[options]
mode bmc
depth 400000
expect timeout,pass,fail
timeout 600

[engines]
smtbmc yices

[script]
read_verilog -sv test_eq.sv
read_ilang mutated.il
prep -top miter
fmcombine miter ref uut
flatten
opt -fast

[files]
test_eq.sv
mutated.il
